# **SALES ANALYSIS**

In [1]:
import pandas as pd

#### **Task1#** : Merging 12 months of sales data into a single file

In [100]:
all_df=pd.read_csv("data/Sales_Data/"+"Sales_April_2019.csv")
all_df.shape

(18383, 6)

In [101]:
for i in ['January','February','March','May','June','July','August','September','October','November','December']:
    df_month=pd.read_csv("data/Sales_Data/"+"Sales_"+i+"_2019.csv")
    all_df=pd.concat([all_df,df_month])
all_df.shape

(186850, 6)

In [102]:
## Converting the data into a csv file
all_df.to_csv("data/Sales_Data/all_data.csv",index=False)
all_df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

### **Clean Up the data!**

#### **Drop NAN**

In [103]:
nan_df=all_df[all_df.isna().any(axis=1)]
nan_df.head()

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1         NaN     NaN              NaN        NaN        NaN              NaN
356       NaN     NaN              NaN        NaN        NaN              NaN
735       NaN     NaN              NaN        NaN        NaN              NaN
1433      NaN     NaN              NaN        NaN        NaN              NaN
1553      NaN     NaN              NaN        NaN        NaN              NaN

In [104]:
all_df=all_df.dropna()

#### **Finding 'Or' as the month and removing those**

In [105]:
all_df[all_df['Order Date'].str[0:2]=='Or'].head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [106]:
all_df=all_df[all_df['Order Date'].str[0:2]!='Or']

#### **Task2#** : Augment data with additional columns

In [107]:
all_df['Month']=all_df['Order Date'].str[0:2]
all_df['Month']=all_df['Month'].astype('int32')
all_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 25116
Data columns (total 7 columns):
Order ID            185950 non-null object
Product             185950 non-null object
Quantity Ordered    185950 non-null object
Price Each          185950 non-null object
Order Date          185950 non-null object
Purchase Address    185950 non-null object
Month               185950 non-null int32
dtypes: int32(1), object(6)
memory usage: 10.6+ MB

#### **QUESTION 1: What was the best month for sales?How much was earned that month?**

In [108]:
all_df[['Price Each','Quantity Ordered','Month']].groupby('Month').sum().head()

,Price Each,Quantity Ordered
Month,,
1,70014.9511.99149.9911.992.99389.9911.9599.9915...,1121111111113111111111111211111111111112111111...
2,14.952.9911.95170014.953.847003.84389.9914.953...,1111111111211111111111111211111112411121111211...
3,2.992.9911.9999.99999.9911.9999.99999.9911.953...,1111111111111111211211111151211111111131111111...
4,11.9599.9960011.9911.9911.9599.9911.95170011.9...,2111111111111111111111111112111211111112131121...
5,150149.9970015060011.9515099.9915099.993.84150...,1111111111211111111111111111111121111111111111...

#### Converting the datatype to float from string

In [ ]:
all_df[['Quantity Ordered']] = all_df[['Quantity Ordered']].astype('int32') 
all_df[['Price Each']] = all_df[['Price Each']].astype('float64')
all_df['Total_Price']=all_df['Quantity Ordered']*all_df['Price Each']
all_df.head()

#### **pd.to_numeric()**

In [ ]:
## We can use pd.to_numeric to convert the datatype if we dont know the correct data type
all_df['Quantity Ordered'] = pd.to_numeric(all_df['Quantity Ordered'])

In [ ]:
all_df[['Total_Price','Month']].groupby('Month').sum().sort_values('Total_Price',ascending=False)

In [ ]:
import matplotlib.pyplot as plt
plt.plot(results['Month'],results['Total_Price'])
plt.show()